START_MESSAGE = """✨ Добро пожаловать в Beads Factory! ✨
Магазин стильных аксессуаров и украшений ручной работы.

Здесь вы можете:
• просмотреть каталог изделий
• выбрать понравившиеся аксессуары
• добавить их в корзину
• оформить заказ прямо в боте

Если понадобится помощь — я всегда рядом 💛
Приятных покупок!"""

MENU_MESSAGE = """Главное меню

Выберите нужный раздел 👇

• Каталог — просмотрите украшения
• Корзина — ваши выбранные товары и оформление заказа
• FAQ — ответы на частые вопросы
• Связаться с менеджером — помощь и консультации"""

CATALOG_MESSAGE = """✨ Каталог украшений Beads Factory ✨

Мы открыли для вас полный список доступных изделий.
Здесь собраны уникальные украшения ручной работы: браслеты, колье, подвески, серьги и наборы, созданные с вниманием к деталям.

Чтобы продолжить, выберите нужную категорию ниже 👇
Каждый раздел откроет подборку товаров с фотографиями, описаниями и ценами.

Приятного просмотра и приятных покупок! 💛"""

CART_MESSAGE = """🛒 Ваша корзина — Beads Factory

Здесь собраны все товары, которые вы добавили во время просмотра каталога.
Вы можете проверить выбранные позиции, изменить количество или удалить ненужные изделия.

Если всё выглядит верно — переходите к оформлению заказа.
Бот предложит ввести контактные данные и подтвердить покупку.

Выберите одно из действий ниже 👇"""

MANAGER_MESSAGE="""📞 Связь с менеджером — Beads Factory

Если у вас возникли вопросы по товарам, заказу или работе магазина — наш менеджер с радостью поможет вам.

Вы можете:
• уточнить наличие изделий
• получить рекомендации
• проверить статус заказа
• обсудить индивидуальный заказ

Нажмите кнопку ниже, чтобы написать менеджеру напрямую 👇
@wntkkk
Мы отвечаем как можно быстрее!"""

FAQ_MESSAGE = """❓ Часто задаваемые вопросы — Beads Factory

Здесь вы найдёте ответы на самые популярные вопросы о нашем магазине и оформлении заказов.
Пожалуйста, выберите интересующую тему ниже 👇

• Как оформить заказ?
Краткая инструкция по покупке через бота.

• Оплата и доставка
Какие способы оплаты доступны и как происходит отправка.

• Наличие товаров
Обновление ассортимента и индивидуальные заказы.

• Возвраты и обмен
Условия возврата или замены изделия.

Если вы не нашли ответ на свой вопрос — вы всегда можете связаться с менеджером во вкладке «Связь с менеджером» 💛"""